Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
vgg16 (Functional)           (None, 4, 4, 512)         14714688  
_________________________________________________________________
flatten (Flatten)            (None, 8192)              0         
_________________________________________________________________
dropout (Dropout)            (None, 8192)              0         
_________________________________________________________________
dense (Dense)                (None, 64)                524352    
_________________________________________________________________
dropout_1 (Dropout)          (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 288)               18720     
_________________________________________________________________
dense_2 (Dense)              (None, 320)               92480     
_________________________________________________________________
dense_3 (Dense)              (None, 224)               71904     
_________________________________________________________________
dense_4 (Dense)              (None, 4)                 900       
=================================================================
Total params: 15,423,044
Trainable params: 15,423,044
Non-trainable params: 0
_________________________________________________________________
