Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_12 (Conv2D)           (None, 150, 150, 128)     3584      
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, 75, 75, 128)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 75, 75, 64)        73792     
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 75, 75, 64)        36928     
_________________________________________________________________
max_pooling2d_7 (MaxPooling2 (None, 37, 37, 64)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 37, 37, 64)        0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 37, 37, 64)        36928     
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 37, 37, 96)        55392     
_________________________________________________________________
max_pooling2d_8 (MaxPooling2 (None, 18, 18, 96)        0         
_________________________________________________________________
dropout_7 (Dropout)          (None, 18, 18, 96)        0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 18, 18, 64)        55360     
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 18, 18, 64)        36928     
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 9, 9, 64)          0         
_________________________________________________________________
dropout_8 (Dropout)          (None, 9, 9, 64)          0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 9, 9, 96)          55392     
_________________________________________________________________
flatten_2 (Flatten)          (None, 7776)              0         
_________________________________________________________________
dropout_9 (Dropout)          (None, 7776)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 320)               2488640   
_________________________________________________________________
dense_5 (Dense)              (None, 4)                 1284      
=================================================================
Total params: 2,844,228
Trainable params: 2,844,228
Non-trainable params: 0
_________________________________________________________________
